tutorials/multiphase/overInterDyMFoam/boatAndPropeller/0.orig/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    ".*"
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }

    "(hullWall|propellerWall|rudderWall)"
    {
         type            calculated;
        value           uniform (0 0 0);
    }
    oversetPatch
    {
        patchType       overset;
        type            zeroGradient;
    }
    "overset.*"
    {
        patchType       overset;
        type            zeroGradient;
    }
    atmosphere
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    defaultFaces
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
